Autodesk.Revit.DB.DGNExportOptions.GetPredefinedOptions(Autodesk.Revit.DB.Document,System.String)
Returns an instance DGNExportOptions containing settings from a predefined export setup.
document:
A Revit project document to retrieve the setup from.
setup:
The name of a predefined export setup from the specified document.
Returns:
An instance of predefined DGNExportOptions, or null if the name was not found.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.DGNExportOptions.SetExportLineweightTable(Autodesk.Revit.DB.ExportLineweightTable)
Sets the line weight table to use during export.
lineweightTable:
The line weight table to be set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.DGNExportOptions.GetPredefinedSetupNames(Autodesk.Revit.DB.Document)
Returns a list of names of predefined setups of DGN export options.
Remarks:
To get predefined options in the desired format use the static method
getPredefinedOptions defined in DGNExportOptions.
document:
A Revit document to retrieve names from.
Returns:
An array of strings representing names of predefined setups.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.DGNExportOptions.WorkingUnits
If true, Main Units will be used. If false, Sub Units will be used.
Default value of WorkingUnits is true.
Since:
2021.1

Autodesk.Revit.DB.DGNExportOptions.SeedName
The name of the DGN seed.
Default value of seedName is empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.DGNExportOptions.#ctor(Autodesk.Revit.DB.DGNExportOptions)
Constructs a new instance of DGNExportOptions as a copy of the export options.
option:
The options to be copied.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null